BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90USB647.PIC
        <edc:AdjustPoint edc:_addr="0x93" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x94" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT3" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:SFRDef edc:_addr="0x96" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR3" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:SFRDef edc:_addr="0x98" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR3A" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:SFRDef edc:_addr="0x9A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR3B" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:SFRDef edc:_addr="0x9C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR3C" edc:nzwidth="0x10" ltx:memberofperipheral="TC3"/>
        <edc:SFRDef edc:_addr="0x9E" edc:access="-----nnn" edc:cname="UHCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SOFEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESET" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESUME" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x9F" edc:access="-nnnnnnn" edc:cname="UHINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DCONNI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DDISCI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSMEDI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRSMI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HSOFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UHUPI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA0" edc:access="-nnnnnnn" edc:cname="UHIEN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DCONNE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DDISCE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSMEDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRSME" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HSOFE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWUPE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA1" edc:access="nnnnnnnn" edc:cname="UHADDR" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST"/>
        <edc:SFRDef edc:_addr="0xA2" edc:access="nnnnnnnnnnnnnnnn" edc:cname="UHFNUM" edc:nzwidth="0x10" ltx:memberofperipheral="USB_HOST"/>
        <edc:SFRDef edc:_addr="0xA4" edc:access="nnnnnnnn" edc:cname="UHFLEN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST"/>
        <edc:SFRDef edc:_addr="0xA5" edc:access="nnnnnnnn" edc:cname="UPINRQX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST"/>
        <edc:SFRDef edc:_addr="0xA6" edc:access="nnnnnnnn" edc:cname="UPINTX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSTALLI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXSTPI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RWAL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA7" edc:access="nnnnnnnn" edc:cname="UPNUM" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST"/>
        <edc:SFRDef edc:_addr="0xA8" edc:access="-nnnnnnn" edc:cname="UPRST" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRST" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA9" edc:access="-nn-n--n" edc:cname="UPCONX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xAA" edc:access="nnnnnnnn" edc:cname="UPCFG0X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEPNUM" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xAB" edc:access="-nnnnnn-" edc:cname="UPCFG1X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PSIZE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
