BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90USB647.PIC
        <edc:SFRDef edc:_addr="0xC9" edc:access="nnnnnnnn" edc:cname="UCSR1B" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB81" edc:desc="Transmit Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB81" edc:desc="Receive Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ12" edc:desc="Character Size" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN1" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEN1" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRIE1" edc:desc="USART Data register Empty Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIE1" edc:desc="TX Complete Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIE1" edc:desc="RX Complete Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCA" edc:access="nnnnnnnn" edc:cname="UCSR1C" edc:nzwidth="0x8" ltx:memberofperipheral="USART1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCPOL1" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ1" edc:desc="Character Size" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="USBS1" edc:desc="Stop Bit Select" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="1-bit" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="2-bit" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="UPM1" edc:desc="Parity Mode Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Enabled, Even Parity" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Enabled, Odd Parity" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="UMSEL1" edc:desc="USART Mode Select" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Asynchronous USART" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Synchronous USART" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Master SPI" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xCB" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xCC" edc:access="nnnnnnnnnnnnnnnn" edc:cname="UBRR1" edc:nzwidth="0x10" ltx:memberofperipheral="USART1"/>
        <edc:SFRDef edc:_addr="0xCE" edc:access="nnnnnnnn" edc:cname="UDR1" edc:nzwidth="0x8" ltx:memberofperipheral="USART1"/>
        <edc:AdjustPoint edc:_addr="0xCF" edc:offset="0x8"/>
        <edc:SFRDef edc:_addr="0xD7" edc:access="nn-n---n" edc:cname="UHWCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_GLOBAL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UVREGE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="UVCONE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="UIDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UIMOD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD8" edc:access="nnnn--nn" edc:cname="USBCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_GLOBAL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VBUSTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDTE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="OTGPADE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FRZCLK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HOST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="USBE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD9" edc:access="----n-nn" edc:cname="USBSTA" edc:nzwidth="0x8" ltx:memberofperipheral="USB_GLOBAL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VBUS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDA" edc:access="------nn" edc:cname="USBINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_GLOBAL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VBUSTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDTI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xDB" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xDD" edc:access="--nnnnnn" edc:cname="OTGCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_GLOBAL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VBUSRQC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VBUSREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VBUSHWC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRPSEL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRPREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HNPREQ" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDE" edc:access="--nnnnnn" edc:cname="OTGIEN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_GLOBAL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRPE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VBERRE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCERRE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ROLEEXE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HNPERRE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STOE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDF" edc:access="--nnnnnn" edc:cname="OTGINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_GLOBAL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRPI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VBERRI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BCERRI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ROLEEXI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HNPERRI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STOI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE0" edc:access="-----nnn" edc:cname="UDCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DETACH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RMWKUP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSM" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE1" edc:access="-nnnnn-n" edc:cname="UDINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPI" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSMI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSMI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE2" edc:access="-nnnnn-n" edc:cname="UDIEN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SUSPE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOFE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKEUPE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EORSME" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPRSME" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE3" edc:access="nnnnnnnn" edc:cname="UDADDR" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UADD" edc:nzwidth="0x7"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="UDFNUM" edc:nzwidth="0x10" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:SFRDef edc:_addr="0xE6" edc:access="---n----" edc:cname="UDMFN" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="FNCERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xE7" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnn" edc:cname="UEINTX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLEDI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSTPI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKOUTI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RWAL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKINI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE9" edc:access="nnnnnnnn" edc:cname="UENUM" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:SFRDef edc:_addr="0xEA" edc:access="-nnnnnnn" edc:cname="UERST" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPRST" edc:nzwidth="0x7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEB" edc:access="--nnn--n" edc:cname="UECONX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLRQ" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEC" edc:access="nn-----n" edc:cname="UECFG0X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPDIR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="-nnnnnn-" edc:cname="UECFG1X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPBK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="EPSIZE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="nnn-nnnn" edc:cname="UESTA0X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEF" edc:access="-----nnn" edc:cname="UESTA1X" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nn-nnnnn" edc:cname="UEIENX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXINE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STALLEDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOUTE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSTPE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKOUTE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NAKINE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLERRE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="UEDATX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:SFRDef edc:_addr="0xF2" edc:access="nnnnnnnn" edc:cname="UEBCLX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:SFRDef edc:_addr="0xF3" edc:access="nnnnnnnn" edc:cname="UEBCHX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:SFRDef edc:_addr="0xF4" edc:access="nnnnnnnn" edc:cname="UEINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_DEVICE"/>
        <edc:SFRDef edc:_addr="0xF5" edc:access="-nnnnnnn" edc:cname="UPERRX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DATATGL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DATAPID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRC16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnn" edc:cname="UPBCLX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST"/>
        <edc:SFRDef edc:_addr="0xF7" edc:access="nnnnnnnn" edc:cname="UPBCHX" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST"/>
        <edc:SFRDef edc:_addr="0xF8" edc:access="nnnnnnnn" edc:cname="UPINT" edc:nzwidth="0x8" ltx:memberofperipheral="USB_HOST"/>
        <edc:SFRDef edc:_addr="0xF9" edc:access="nnn--nnn" edc:cname="OTGTCON" edc:nzwidth="0x8" ltx:memberofperipheral="USB_GLOBAL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VALUE_2" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PAGE" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="OTGTCON_7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
